Revit 2027 API
BRepBuilderPersistentIds.IsBRepBuilderGeometryIdFaceOrEdge Method
 Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, the input BRepBuilderGeometryId must represent the ID of either a Face or an Edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBRepBuilderGeometryIdFaceOrEdge(
	BRepBuilderGeometryId brepBuilderGeometryId
)
Public Function IsBRepBuilderGeometryIdFaceOrEdge (
	brepBuilderGeometryId As BRepBuilderGeometryId
) As Boolean
public:
bool IsBRepBuilderGeometryIdFaceOrEdge(
	BRepBuilderGeometryId^ brepBuilderGeometryId
)
member IsBRepBuilderGeometryIdFaceOrEdge :
        brepBuilderGeometryId : BRepBuilderGeometryId -> bool
Parameters
brepBuilderGeometryId BRepBuilderGeometryId
 The BRepBuilderGeometryId to be used in a new correspondence.
Return Value
Boolean
 True if the input BRepBuilderGeometryId represents the ID of either a Face or an Edge, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method returns false also in the case when the associated BRepBuilder is not valid. Call IsAssociatedBRepBuilderValid() to check the associated BRepBuilder.
See Also
Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace